# frozen_string_literal: true

# some fonts
tap 'homebrew/cask-fonts'

# Dual Panel File Browser
cask 'marta'

# Fast GPU rendered terminal emulator
cask 'alacritty'

brew 'nushell'

# Kubernetes goodies
brew 'kubectl'
brew 'k9s'

# for erlang
brew 'wxwidgets'
brew 'autoconf'
brew 'fop'
brew 'libiodbc'
brew 'openjdk'

# used by my alfred workflow (Default Browser)
brew 'defaultbrowser'

# help from terminal
brew 'howdoi'

# code stats
brew 'scc'

# sqlite3
brew 'sqlite'

# image manipulation
brew 'imagemagick'

# json querying + pretty printing
brew 'jq'

# html querying
brew 'htmlq'

# easily copy tabular data
brew 'yank'

# postgres pager
brew 'pspg'

# for neovim
brew 'lua'

# quickly jump to recently used folders
brew 'autojump'

# better cat with syntax highlighting
brew 'bat'

# compile C stuff
brew 'cmake'

# better git diffs
brew 'diff-so-fancy'

# auto run env scripts when entering a dir
brew 'direnv'

# fuzzy finder
brew 'fzf'

# C++ compiler
brew 'gcc'

# source control
brew 'git'

# GTags for use in Vim
brew 'global'

# Encryption + verification of signed downloads
brew 'gnupg'

# keep grep up to date
brew 'grep'

# show active process and their telemetry
brew 'htop'

# Github CLIs
brew 'gh'

# docker desktop for containers
cask 'docker'

# curses interface for docker + git
brew 'lazydocker'
brew 'lazygit'

# build tool
brew 'make'

# download files from the terminal, used by some scripts
brew 'wget'

# display system info
brew 'neofetch'

# best code editor on planet earth
brew 'neovim'

# OpenSSL - important for compiling things that support ssl
brew 'openssl@1.1'

# better, faster grep
brew 'ripgrep'

# like grep but for files and folder names
brew 'fd'

# linter for bash scripts
brew 'shellcheck'

# keep tree up to date
brew 'tree'

# GNU File, Shell, and Text utilities
# https://www.gnu.org/software/coreutils
brew 'coreutils'

# required by ccls
brew 'llvm'

# terminal multiplexing and cool stuff
brew 'zellij'

# shell completions for nushell completions
tap 'rsteube/homebrew-tap'
brew 'rsteube/tap/carapace'

# fonts
tap 'homebrew/cask-fonts'
brew 'font-hack-nerd-font'
